backend/app/controllers/daycares_controller.rb

SELECT "daycares".* FROM "daycares" WHERE (undefined) LIMIT ?  [["LIMIT", 1]]
---
  def index
    @daycares = Daycare.all